posts/exwm-on-raspberry-pi-os-lite/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>EXWM on Raspberry Pi OS Lite | notroot</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://joseph8th.github.io/posts/exwm-on-raspberry-pi-os-lite/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Joseph Edwards VIII">
<link rel="prev" href="../blog-is-a-weird-word/" title="Blog is a Weird Word" type="text/html">
<link rel="next" href="../publishing-with-nikola-in-emacs/" title="Publishing with Nikola in Emacs" type="text/html">
<meta property="og:site_name" content="notroot">
<meta property="og:title" content="EXWM on Raspberry Pi OS Lite">
<meta property="og:url" content="https://joseph8th.github.io/posts/exwm-on-raspberry-pi-os-lite/">
<meta property="og:description" content="Install Raspberry Pi OS Lite (buster)
Login as pi/raspberry
Enable sources in /etc/apt/sources.list, then sudo apt update &amp;&amp; apt upgrade

Install basic but required build tools:



sudo apt install bu">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-11-12T15:59:41-05:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="exwm">
<meta property="article:tag" content="pi">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">notroot</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">EXWM on Raspberry Pi OS Lite</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Joseph Edwards VIII
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-11-12T15:59:41-05:00" itemprop="datePublished" title="2020-11-12 15:59">2020-11-12 15:59</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <ol class="org-ol">
<li>Install Raspberry Pi OS Lite (buster)</li>
<li>Login as <code>pi/raspberry</code>
</li>
<li>Enable sources in <code>/etc/apt/sources.list</code>, then <code>sudo apt update &amp;&amp; apt upgrade</code>
</li>
<li>
<p>
Install basic but required build tools:
</p>

<p>
<code>sudo apt install build-essential</code>
</p>
</li>

<li>
<p>
Install <code>xorg</code> and WebKitGTK+:
</p>

<p>
<code>sudo apt install xorg xorg-dev libwebkit2gtk-4.0-dev</code>
</p>
</li>

<li>
<p>
Prepare for latest Emacs install by installing dependencies of latest previous version in the repo:
</p>

<p>
<code>sudo apt build-dep emacs</code>
</p>
</li>

<li>
<p>
Get the latest Emacs, and configure it thusly:
</p>

<p>
<code>./configure --with-imagemagick --with-xwidgets</code>
</p>
</li>

<li>
<p>
Build and install Emacs:
</p>

<p>
<code>make &amp;&amp; sudo make install</code>
</p>
</li>

<li>
<p>
Get my literate README:
</p>

<p>
<code>git clone https://github.com/joseph8th/literatemacs.git</code>
</p>

<ul class="org-ul">
<li>Open <code>README.org</code> in Emacs, then follow instructions to get a basic <code>init.el</code> installed in <code>.emacs.d/</code>
</li>
<li>In addition, copy the <code>elisp/</code> directory into <code>.emacs.d/</code>
</li>
<li>
<p>
Run Emacs to install packages and debug init as needed:
</p>

<p>
<code>emacs --debug-init</code>
</p>
</li>
</ul>
</li>

<li>
<p>
Open <code>README.org</code> again, and enable the EXWM entanglement. Then save, and it will tangle EXWM files.
</p>

<div class="highlight"><pre><span></span>    cp xinitrc.exwm ~/.xinitrc
    ln -s exwm-init.el ~/.emacs.d/
</pre></div>
</li>

<li>Reboot and do <code>startx</code> after login. Debug init as needed.</li>
</ol>
</div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/emacs/" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../../categories/exwm/" rel="tag">exwm</a></li>
            <li><a class="tag p-category" href="../../categories/pi/" rel="tag">pi</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../blog-is-a-weird-word/" rel="prev" title="Blog is a Weird Word">Previous post</a>
            </li>
            <li class="next">
                <a href="../publishing-with-nikola-in-emacs/" rel="next" title="Publishing with Nikola in Emacs">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2020         <a href="mailto:jedwards8th@gmail.com">Joseph Edwards VIII</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
